In [4]:
import numpy as np
import pandas as pd
import cx_Oracle

In [5]:
def get_data_from_db(query):
    conn = cx_Oracle.connect('hoseo', 'hoseo', 'localhost:1521/xe')
    df = pd.read_sql(query, conn)
    conn.close()
    return df

In [6]:
query = """
    SELECT *
    FROM APT_DEAL_PRICE
    WHERE APT_ID < 100
    """

In [7]:
dataD = get_data_from_db(query)
dataD.info()
dataD.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   APT_ID           99 non-null     int64
 1   REGION           99 non-null     object
 2   REGION_SUB       99 non-null     object
 3   APT_NAME         99 non-null     object
 4   APT_SIZE         99 non-null     float64
 5   APT_FLOOR        99 non-null     int64
 6   CONTRACT_DATE    99 non-null     datetime64[ns]
 7   CONTRACT_PRICE   99 non-null     int64
 8   COMPLETION_YEAR  99 non-null     int64
 9   STREET_NUM       99 non-null     object
 10  STREET_NAME      99 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(4), object(5)
memory usage: 8.6+ KB

,APT_ID,REGION,REGION_SUB,APT_NAME,APT_SIZE,APT_FLOOR,CONTRACT_DATE,CONTRACT_PRICE,COMPLETION_YEAR,STREET_NUM,STREET_NAME
0,1,강원도,강릉시 견소동,송정한신,84.94,5,2012-08-24,130000000,1997,202,경강로2539번길 8
1,2,강원도,강릉시 견소동,송정한신,59.80,15,2012-08-27,85000000,1997,202,경강로2539번길 8
2,3,강원도,강릉시 견소동,송정한신,59.80,1,2012-08-31,60000000,1997,202,경강로2539번길 8
3,4,강원도,강릉시 견소동,송정해변신도브래뉴아파트,84.99,7,2012-08-08,150000000,2005,289,경강로2539번길 22
4,5,강원도,강릉시 견소동,송정해변신도브래뉴아파트,84.99,9,2012-08-09,165000000,2005,289,경강로2539번길 22